In [1]:
import pandas as pd

In [10]:
data = {

    'Name':['Shafeen','Shaziya','Qassim','Arbaz','Bhakti','Imran','Soumya','Uday','Sudarshan','Kiran','Keethana','Likhita'],
    'Marks':[80,90,85,70,75,95,100,50,55,60,88,90],
    'Grade':['A','A+','A','B','B+','A+','A+','C','C','C+','A','A+']
}

df = pd.DataFrame(data)

In [11]:
print(df)

         Name  Marks Grade
0     Shafeen     80     A
1     Shaziya     90    A+
2      Qassim     85     A
3       Arbaz     70     B
4      Bhakti     75    B+
5       Imran     95    A+
6      Soumya    100    A+
7        Uday     50     C
8   Sudarshan     55     C
9       Kiran     60    C+
10   Keethana     88     A
11    Likhita     90    A+

In [12]:
# Create a dataframe of employees with columns: Name, Designation, Department, Salary. Make 8 rows.

employee = {

    'Name':['Shafeen','Shaziya','Qassim','Arbaz','Bhakti','Imran','Soumya','Uday','Sudarshan','Kiran'],
    'Designation':['IT Analyst','HR Manager','Network Admin','Software Developer','Data Analyst','Web Developer','Data Scientist','Finance Head',
   'App Developer','AI Analyst' ],
    'Department':['IT','HR','IT','Software','Data','Software','Data','Finance','Software','AI'],
    'Salary':[45000,50000,60000,65000,70000,75000,80000,85000,90000,95000]
}

df = pd.DataFrame(employee)

In [13]:
print(df)

        Name         Designation Department  Salary
0    Shafeen          IT Analyst         IT   45000
1    Shaziya          HR Manager         HR   50000
2     Qassim       Network Admin         IT   60000
3      Arbaz  Software Developer   Software   65000
4     Bhakti        Data Analyst       Data   70000
5      Imran       Web Developer   Software   75000
6     Soumya      Data Scientist       Data   80000
7       Uday        Finance Head    Finance   85000
8  Sudarshan       App Developer   Software   90000
9      Kiran          AI Analyst         AI   95000

In [15]:
df.head(1)

      Name Designation Department  Salary
0  Shafeen  IT Analyst         IT   45000

In [18]:
df.tail(1)

    Name Designation Department  Salary
9  Kiran  AI Analyst         AI   95000

In [19]:
df.shape

(10, 4)

In [20]:
df.columns

Index(['Name', 'Designation', 'Department', 'Salary'], dtype='object')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         10 non-null     object
 1   Designation  10 non-null     object
 2   Department   10 non-null     object
 3   Salary       10 non-null     int64
dtypes: int64(1), object(3)
memory usage: 452.0+ bytes

In [22]:
df.describe()

             Salary
count     10.000000
mean   71500.000000
std    16674.997918
min    45000.000000
25%    61250.000000
50%    72500.000000
75%    83750.000000
max    95000.000000

In [23]:
df.dtypes

Name           object
Designation    object
Department     object
Salary          int64
dtype: object

In [26]:
df.sample(3)

      Name    Designation Department  Salary
9    Kiran     AI Analyst         AI   95000
1  Shaziya     HR Manager         HR   50000
5    Imran  Web Developer   Software   75000

In [25]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
print(df.sort_values(by='Salary',ascending=False))

        Name         Designation Department  Salary
9      Kiran          AI Analyst         AI   95000
8  Sudarshan       App Developer   Software   90000
7       Uday        Finance Head    Finance   85000
6     Soumya      Data Scientist       Data   80000
5      Imran       Web Developer   Software   75000
4     Bhakti        Data Analyst       Data   70000
3      Arbaz  Software Developer   Software   65000
2     Qassim       Network Admin         IT   60000
1    Shaziya          HR Manager         HR   50000
0    Shafeen          IT Analyst         IT   45000

In [34]:
print(df['Department'].value_counts())

Department
Software    3
IT          2
Data        2
HR          1
Finance     1
AI          1
Name: count, dtype: int64